Барбершоп/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Барбершоп/src/Documents/Заказ/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка",,ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Для каждого НоменклатураПодбора из ПараметрыПеретаскивания.Значение Цикл 
		СтруктураОтбора = Новый Структура("Номенклатура", НоменклатураПодбора);
	 	НайденныеСтроки = Объект.СписокНоменклатуры.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество()=0  Тогда
			НоваяСтрока =Объект.СписокНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураПодбора; 
			НоваяСтрока.Количество = 1;
		Иначе
			ПерваяСтрока = НайденныеСтроки[0];
			ПерваяСтрока.Количество = ПерваяСтрока.Количество + 1;
		КонецЕсли;
		
	
	КонецЦикла;
	
	
КонецПроцедуры
